function [] = erotima3( diaspora,Snr_db)
if nargin == 0
	diaspora = 10 ^-6;
	Snr_db = 10;
elseif nargin == 1
	Snr_db = 10;
end
test_d = isscalar(diaspora);
test_S = isscalar (Snr_db); %ελέγχω αμα το snr_db είναι πίνακας 1 χ 1
if (test_d == false) || (test_S == false )
	% || σημαίνει λογικο OR
	errordlg('wrong inputs','error') % αμα έστω και ένα απτα παραπανω είναι false βγάζει ένα errordlg
return % η εντολη return τερματίζει την function
end
snr = 10^(Snr_db/(10)); % αφου το snr_db θα είναι scalar (πινακας 1 Χ 1) δεν χρειαζετε να βγάλω την τελειά αφου δεν εχω να κανω πράξεις με διανύσματα.
E = diaspora *snr; % Ευρεση της μέσης Ενέργειας από τους τύπους που δίνονται στο project
A = sqrt(E); % υπολογιζω τα σύμβολα
picture = imread('Sailing_small.gif');%η εντολη imread διαβάζει την εικόνα δηλαδή στην περίπτωση μας την κάνει 256 χ 256 uint8 (unsigned integer)
v = reshape(picture,numel(picture),[]); % η εντολη reshape(array που θέλω να τροποποιησω,γραμμες που θελω,στηλες που θέλω) μετατρέπει έναν πίνακα σε διάνυσμα ή στήλη ή ότι θέλουμε .Στην περίπτωση μας μετατρέπω τον πίνακα σε στήλη.
η εντολη numel βγάζει σαν output των αριθμό τον στοιχείων ενός array (διανύσματος).Στην περίπτωση μας εμφανίζει τα στοιχεία του πίνακα που είναι 256*256 = 65536
επίσης θα ήθελα να επισημάνω στην reshape εχω βάλει ένα [] αυτό σημαίνει κανε την πράξει οσα βγουν δηλαδή αφου έχω πάρει όλα τα στοιχεία της εικόνας και τα εχω κάνει σαν γραμμές αρα θα εχω μια στήλη μόνο.
B = dec2bin(v,8);% η εντολη dec2bin μετατρέπει τους αριθμούς από δεκαδικο σε δυαδικο επίσης το 8 που εχω βάλει είναι η κάθε δεκαδική λέξη που θα γίνει δυαδική θα εκφραστεί σαν 8 bits δηλαδή αμα εχω το 2 σε δεκαδικο η dec2bin(x,8) θα γίνει 00000010 .Επίσης το διάνυσμα στήλη Β ειναι string ( χαρακτήρας)
c = (B)’;%ο τονος γυρίζει τον πίνακα δηλαδή από 65536 χ 8 θα γίνει 8 χ 65536
xn = zeros(1,numel(c)); %στο διάνυσμα –γραμμή αυτό θα αποθηκεύσω τα σύμβολα που στέλνει ο πομπος
u = num2str(zeros(numel(c),1)); %αφου θέλουμε να κάνουμε το διάνυσμα στήλη u να περιέχει τα δυαδικά ψηφιά του πομπού θα πρέπει να φτιάξουμε ένα διάνυσμα –στήλη ισο με τα στοιχεία του πίνακα c για αυτό χρησιμοποιώ την εντολη numel που ανάφερα παραπανω
επίσης ο πίνακας c περιέχει string(χαρακτήρες) αρα και ο u πρέπει να είναι string αλλιώς ο compiler θα χτυπήσει error
%κωδικοποιώ τον πομπό
for i = 1 : numel(c);
	u(i) = (c(i));
	if u(i) == '1'
		xn(i) = A; % το xn είναι διανυσμα-γραμμη
	else
		xn(i) = -A;
	end
end
%δημιουργία θορύβου
wn = randn(size(xn)); %δημιουργώ τον θόρυβο μεσω της εντολής randn που έχει μέση τιμή 0
tipiki_apoklisi = sqrt(diaspora);
wn = tipiki_apoklisi.*wn; % τωρα ο θόρυβος έχει Gaussian κατανομή
%%%%% δεκτης
rn = xn + wn; %Δημιουργία του δεκτή προσθέτοντας θόρυβο στα σύμβολα που στέλνει ο πομπος(δυανισμα-γραμμη)
C_receiver = zeros(size(c));% ο πίνακας C_receiver είναι ο ίδιον διαστάσεων με τον πίνακα c γεμάτο με μηδενικά .
% αποκωδικοποιώ τον δεκτή οπου αμα το rn είναι θετικο ο πομπος έστειλε 1 αλλιώς ο πομπος έστειλε 0
for j = 1 : numel(receiver)
	if rn(j) >= 0
		C_receiver (j) = 1;
	else
		C_receiver (j) = 0;
	end
end
x = zeros(1,length(C_receiver));
for i = 1 :length(C_receiver)
	temp = num2str(C_receiver (:,i));% παιρνω την καθε στηλη του πινακα C_receiver και την κανω string λογο η εντολη bin2dec δέχεται inputs strings μόνο
	temp = temp'; %έπειτα ο πίνακας temp είναι δυανυσμα-στηλη το κανω γραμμή
	x(i) = bin2dec(temp); % τέλος μετατρέπω το δυαδικο σε δεκαδικο και το αποθηκεύω στον πίνακα χ (περιέχει αριθμούς όχι strings !!)
end
arxiko1= uint8(x); % μετατρέπω τον πινακα8 από νούμερα σε unsigned integer
arxiko1= reshape(arxiko1,256,256); %αφου όταν διάβασα την εικόνα που έβγαλε σαν αποτέλεσμα έναν πίνακα 256 χ 256 θα πρέπει και εγώ να βγάλω τον ίδιον διαστάσεων αρα μετατρέπω το διανυσμα-γραμμη σε πίνακα 256 χ 256 αντι για το τελευταίο 256 θα μπορούσα να βάλω [] αλλα τώρα ήθελα απλος να τονισο ότι και ο αρχικος μου πίνακας ήταν 256 χ 256
imshow(arxiko1) % δείχνω την εικόνα
end % τελος function